Goodjamp/nrf52840Mouse_SDK15_0/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/ble_app_hids_mouse/main.c
void appAdvStop(void)
{
    ret_code_t ret;
    //DEBUG_LOG("ADV STOP:");
    switch(appState.connectState)
    {
    case CONNECTION_CONNECT:
        appState.isAppAdv = false;
        //DEBUG_LOG("ADV STOP: already stoped");
        break;
    case CONNECTION_START_DISCONNECT:
        appState.isAppAdv = false;
        //DEBUG_LOG("ADV STOP: disconnected process");
        break;
    case CONNECTION_DISCONNECT:
        appState.isAppAdv = false;
        if(!appState.isRealAdv)
        {
            //DEBUG_LOG("ADV STOP: current stop");
            return;
        }
        appState.isRealAdv = false;
         ret = sd_ble_gap_adv_stop(m_advertising.adv_handle);
        //DEBUG_LOG("ADV STOP: ret = %d", ret);
        APP_ERROR_CHECK(ret);
        //DEBUG_LOG("ADV STOP: ok");
        break;
    default:
        break;
    }
    //DEBUG_LOG("ADV STOP: ok");
}


void appAdvStart(void)
{
    ret_code_t ret;
    switch(appState.connectState)
    {
        case CONNECTION_CONNECT:
            // after disconnect nrf automatically start advertising
            appState.isAppAdv = true;
            DEBUG_LOG("ADV START: disconnect connection");
            appDisconnect();
            break;
        case CONNECTION_START_DISCONNECT:
            appState.isAppAdv = true;
            DEBUG_LOG("ADV START: wait disconnect");
            break;
        case CONNECTION_DISCONNECT:
            if(appState.isRealAdv)
            {
                DEBUG_LOG("ADV START: running state");
                break;
            }
            appState.isAppAdv  = true;
            appState.isRealAdv = true;
            DEBUG_LOG("ADV START: start");
            advertising_init(APP_ADV_GLOBAL_INTERVAL, APP_ADV_GLOBAL_TIMEOUT, true);
            ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
            DEBUG_LOG("ADV START: ret = %d", ret);
            APP_ERROR_CHECK(ret);
            break;
        default: break;
    }
    DEBUG_LOG("ADV START: ok");
}

/**@brief Function for initializing the Advertising functionality.
 */
 /*
static void advertising_init(void)
{
    ret_code_t             err_code;
    uint8_t                adv_flags;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = adv_flags;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_whitelist_enabled          = true;
    init.config.ble_adv_directed_high_duty_enabled = true;
    init.config.ble_adv_directed_enabled           = false;
    init.config.ble_adv_directed_interval          = 0;
    init.config.ble_adv_directed_timeout           = 0;
    init.config.ble_adv_fast_enabled               = true;
    init.config.ble_adv_fast_interval              = APP_ADV_FAST_INTERVAL;
    init.config.ble_adv_fast_timeout               = APP_ADV_FAST_DURATION;
    init.config.ble_adv_slow_enabled               = true;
    init.config.ble_adv_slow_interval              = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout               = APP_ADV_SLOW_DURATION;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}
*/

static void advertising_init(uint16_t intervalMSeconds, uint16_t periodSeconds, bool whitelistEnabled)
{
    ret_code_t             err_code;
    uint8_t                adv_flags;
    static ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    adv_flags                            = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = adv_flags;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_whitelist_enabled          = true;
    init.config.ble_adv_directed_high_duty_enabled = false;
    init.config.ble_adv_directed_enabled           = false;
    init.config.ble_adv_directed_interval          = 0;
    init.config.ble_adv_directed_timeout           = 0;
    init.config.ble_adv_fast_enabled               = true;
    init.config.ble_adv_fast_interval              = intervalMSeconds;
    init.config.ble_adv_fast_timeout               = periodSeconds;
    init.config.ble_adv_slow_enabled               = false;
    init.config.ble_adv_slow_interval              = APP_ADV_SLOW_INTERVAL;
    init.config.ble_adv_slow_timeout               = APP_ADV_SLOW_DURATION;

    init.evt_handler   = on_adv_evt;
    init.error_handler = ble_advertising_error_handler;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


bool appPeerGetPeerIdInList(pm_peer_id_t peerIdIn)
{
    pm_peer_id_t peer_id;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);

    while (peer_id != PM_PEER_ID_INVALID )
    {
        if( peerIdIn == peer_id)
        {
            return true;
        }
        peer_id = pm_next_peer_id_get(peer_id);
    }
    return false;
}


static void appAdvRun(advTypeT advType, uint16_t peerId)
{
    ret_code_t ret;

    switch(advType)
    {
    case ADV_IDLE:
        USER_INFO("ADV go idle");
        appState.currentAdvType = ADV_IDLE;
        appAdvStop();
        return;
    case ADV_ADD_NEW: // advertising without white list, but REJECT connection all current peers
        USER_INFO("ADV add new");
        timerStop(stopScanAdvTimerCallback);
        appState.currentAdvType = ADV_ADD_NEW;
        advDirOrdConnState.m_whitelist_peer_cnt = 0;
        break;
    case ADV_RECONNECT_SCAN:

        appUpdateBLEListPeers();
        USER_INFO("Quantity peer in Flash = %d", advDirOrdConnState.m_whitelist_peer_cnt);
        if(advDirOrdConnState.m_whitelist_peer_cnt == 0) // if no peer devices -
        {
            USER_INFO("ADV add new");
            appState.currentAdvType = ADV_ADD_NEW;
        }
        else
        {
            USER_INFO("ADV start scan");
            advDirOrdConnState.loopCnt = 0;
            appState.currentAdvType = ADV_RECONNECT_SCAN;
            timerRun(stopScanAdvTimerCallback, ADV_RECONNECT_SCAN_TIMEOUT);
            scaningTimeout = getTime();
        }
        break;
    case ADV_RECONNECT_CONNECT:
        USER_INFO("ADV start connect ");
        appState.currentAdvType = ADV_RECONNECT_CONNECT;
        // set white list parameters
        advDirOrdConnState.m_whitelist_peers[0] = peerId;
        advDirOrdConnState.m_whitelist_peer_cnt = 1;
        break;
    default:
        break;
    }
    appAdvStop();  // use this stop adv for activate white list with new devices

    ret = pm_whitelist_set((advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (NULL) : (advDirOrdConnState.m_whitelist_peers),
                           (advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (0)    : (advDirOrdConnState.m_whitelist_peer_cnt));
    ret = pm_device_identities_list_set((advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (NULL) : (advDirOrdConnState.m_whitelist_peers),
                                        (advDirOrdConnState.m_whitelist_peer_cnt == 0 ) ? (0)    : (advDirOrdConnState.m_whitelist_peer_cnt));
    DEBUG_LOG("ret = %d", ret);

    if (ret != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(ret);
    }
    appAdvStart();
}


void appAdvIdleProc(nrfBLEAdvEvT inEv, pm_peer_id_t peerId)
{
    appAdvStop();
}


void appAdvAddNewProc(nrfBLEAdvEvT inEv, pm_peer_id_t peerId)
{
    switch(inEv)
    {
    case ADV_EVT_START_CONNECT:
        break;
    case ADV_EVT_STOP_ADV:
        break;
    case ADV_EVT_CONNECT_PREV:
        DEBUG_LOG("Disconnect old device");
        appDisconnect();
        break;
    case ADV_EVT_CONNECT:
        DEBUG_LOG("New dev");
        appAdvStop();
        break;
    }
}


void appAdvDirectProc(nrfBLEAdvEvT inEv, pm_peer_id_t peerId)
{
    ret_code_t err_code;
    switch(inEv)
    {
    case ADV_EVT_START_CONNECT: // 1
        DEBUG_LOG("CONNECT");
        switch(advDirOrdConnState.phase)
        {
        case DEV_SCANNING:  // add device to the list of device that was detected
        {
            uint8_t pos;
            // disconnect input connection
            DEBUG_LOG("_SCANNING_");

