Goodjamp/nrf52840Mouse_SDK15_0/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/ble_app_hids_mouse/main.c
        case BSP_EVENT_KEY_1:
            if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
            {
                mouse_movement_send(0, -MOVEMENT_SPEED);
            }
            break;

        case BSP_EVENT_KEY_2:
            DEBUG_LOG("Clear all bonds");
            appState.isDeleteBonds = true;

            break;

        case BSP_EVENT_KEY_3:
           DEBUG_LOG("ADD_NEW adv start");
           appAdvRun(ADV_ADD_NEW, 0);
           break;

        default:
            break;
    }
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);

    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    app_sched_execute();
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


// Simple event handler to handle errors during initialization.
static void fds_evt_handler(fds_evt_t const * p_fds_evt)
{
    /*
    switch(p_fds_evt->id)
    {
        case  FDS_EVT_INIT:       DEBUG_LOG("FDS_EVT_INIT");        break;
        case  FDS_EVT_WRITE:      DEBUG_LOG("FDS_EVT_WRITE");       break;
        case  FDS_EVT_UPDATE:     DEBUG_LOG("FDS_EVT_UPDATE");      break;
        case  FDS_EVT_DEL_RECORD: DEBUG_LOG("FDS_EVT_DEL_RECORD");  break;
        case  FDS_EVT_DEL_FILE:   DEBUG_LOG("FDS_EVT_DEL_FILE");    break;
        case  FDS_EVT_GC:         DEBUG_LOG("FDS_EVT_GC");          break;
    }
    */
    switch (p_fds_evt->id)
    {
        case FDS_EVT_INIT:
            if (p_fds_evt->result != FDS_SUCCESS)
            {
                // Initialization failed.
            }
            break;
        default:
            break;
    }
}




/**@brief Function for application main entry.
 */
int main(void)
{
    ret_code_t ret;
    bool erase_bonds;

    // Initialize.
    log_init();
    USER_INFO("APPLICATION STARTED");

    initUserTimer();
    stopScanAdvTimerCallback = timerGetCallback(appAdvScanStopCB);
    deviceOrder              = orderMalloc();

    ret = fds_register(fds_evt_handler);
    if (ret != FDS_SUCCESS)
    {
        APP_ERROR_CHECK(ret);
    }
    ret = fds_init();
    if (ret != FDS_SUCCESS)
    {
        APP_ERROR_CHECK(ret);
    }
    //orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
    orderReadFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
    USER_INFO("Quantity items in order = %d",  orderGetQuantity(deviceOrder));
    for(uint8_t cnt = 0; cnt < ORDER_ITEM_QUANTITY; cnt++ )
    {
        USER_INFO("item = %d", orderGetItem(deviceOrder, cnt));
    }


    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    scheduler_init();
    gap_params_init();
    gatt_init();
    //advertising_init();
    services_init();
    sensor_simulator_init();
    conn_params_init();
    peer_manager_init();

    // is device on order the same as on flash:
    if(orderGetQuantity(deviceOrder) != appGetQuantityBLEPeers())
    {
        USER_INFO("Quantity items on order and flash don't equal, clear all");
        orderClean(deviceOrder);
        orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
        if(appGetQuantityBLEPeers() != 0)
        {
            delete_bonds();
        }
    }

    // Start execution.
    timers_start();
    //advertising_start(erase_bonds);
	advertising_init(APP_ADV_GLOBAL_INTERVAL, APP_ADV_GLOBAL_TIMEOUT, true);
    appAdvRun(ADV_RECONNECT_SCAN, 0);

    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
        /******app processing*****************/
        appProcessing();
        userProcessingTimerCallbackFun();
        /*************************************/
    }
}




/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    ret_code_t err_code;

    switch(p_ble_evt->header.evt_id)
    {
         case BLE_GAP_EVT_CONNECTED:                  DEBUG_LOG("CONNECTED");                  break;
         case BLE_GAP_EVT_DISCONNECTED:               DEBUG_LOG("DISCONNECTED");               break;
         case BLE_GAP_EVT_CONN_PARAM_UPDATE:          DEBUG_LOG("CONN_PARAM_UPDATE");          break;
         case BLE_GAP_EVT_SEC_PARAMS_REQUEST:         DEBUG_LOG("SEC_PARAMS_REQUEST");         break;
         case BLE_GAP_EVT_SEC_INFO_REQUEST:           DEBUG_LOG("SEC_INFO_REQUEST");           break;
         case BLE_GAP_EVT_PASSKEY_DISPLAY:            DEBUG_LOG("PASSKEY_DISPLAY");            break;
         case BLE_GAP_EVT_KEY_PRESSED:                DEBUG_LOG("KEY_PRESSED");                break;
         case BLE_GAP_EVT_AUTH_KEY_REQUEST:           DEBUG_LOG("AUTH_KEY_REQUEST");           break;
         case BLE_GAP_EVT_LESC_DHKEY_REQUEST:         DEBUG_LOG("LESC_DHKEY_REQUEST");         break;
         case BLE_GAP_EVT_AUTH_STATUS:                DEBUG_LOG("AUTH_STATUS");                break;
         case BLE_GAP_EVT_CONN_SEC_UPDATE:            DEBUG_LOG("CONN_SEC_UPDATE");            break;
         case BLE_GAP_EVT_TIMEOUT:                    DEBUG_LOG("TIMEOUT");                    break;
         case BLE_GAP_EVT_RSSI_CHANGED:               DEBUG_LOG("RSSI_CHANGED");               break;
         case BLE_GAP_EVT_ADV_REPORT:                 DEBUG_LOG("ADV_REPORT");                 break;
         case BLE_GAP_EVT_SEC_REQUEST:                DEBUG_LOG("SEC_REQUEST");                break;
         case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:  DEBUG_LOG("CONN_PARAM_UPDATE_REQUEST");  break;
         case BLE_GAP_EVT_SCAN_REQ_REPORT:            DEBUG_LOG("SCAN_REQ_REPORT");            break;
         case BLE_GAP_EVT_PHY_UPDATE:                 DEBUG_LOG("PHY_UPDATE");                 break;
         case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST: DEBUG_LOG("DATA_LENGTH_UPDATE_REQUEST"); break;
         case BLE_GAP_EVT_DATA_LENGTH_UPDATE:         DEBUG_LOG("DATA_LENGTH_UPDATE");         break;
    }



    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            //DEBUG_LOG("Connected");
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);

