Goodjamp/nrf52840Mouse_SDK15_0/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/ble_app_hids_mouse/main.c
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

            err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
            APP_ERROR_CHECK(err_code);

            /******app processing*****************/
            if(appAdvGetPrevConn())
            {
                DEBUG_LOG("CON: true");
                break;
            }
            DEBUG_LOG("CON: false");
            appAdvSetRealState(false);
            appConnectSetState(CONNECTION_CONNECT, m_conn_handle);
            appAdvProcessing(ADV_EVT_CONNECT,0);
            /*************************************/

            break;

        case BLE_GAP_EVT_DISCONNECTED:
            DEBUG_LOG("Disconnected");
            /******app processing*****************/
            appAdvSetPrevConn(false);
            appConnectSetState(CONNECTION_DISCONNECT, BLE_CONN_HANDLE_INVALID);
            /*************************************/

            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
            DEBUG_LOG("PHY update request.");
            ble_gap_phys_t const phys =
            {
                .rx_phys = BLE_GAP_PHY_AUTO,
                .tx_phys = BLE_GAP_PHY_AUTO,
            };
            err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
            // Disconnect on GATT Client timeout event.
            DEBUG_LOG("GATT Client Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        case BLE_GATTS_EVT_TIMEOUT:
            // Disconnect on GATT Server timeout event.
            DEBUG_LOG("GATT Server Timeout.");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
            break;

        default:
            // No implementation needed.
            break;
    }
}





/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch(p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:         DEBUG_LOG("PM_EVT_BONDED_PEER_CONNECTED");         break;
        case PM_EVT_CONN_SEC_START:                DEBUG_LOG("PM_EVT_CONN_SEC_START");                break;
        case PM_EVT_CONN_SEC_SUCCEEDED:            DEBUG_LOG("PM_EVT_CONN_SEC_SUCCEEDED");            break;
        case PM_EVT_CONN_SEC_FAILED:               DEBUG_LOG("PM_EVT_CONN_SEC_FAILED");               break;
        case PM_EVT_CONN_SEC_CONFIG_REQ:           DEBUG_LOG("PM_EVT_CONN_SEC_CONFIG_REQ");           break;
        case PM_EVT_CONN_SEC_PARAMS_REQ:           DEBUG_LOG("PM_EVT_CONN_SEC_PARAMS_REQ");           break;
        case PM_EVT_STORAGE_FULL:                  DEBUG_LOG("PM_EVT_STORAGE_FULL");                  break;
        case PM_EVT_ERROR_UNEXPECTED:              DEBUG_LOG("PM_EVT_ERROR_UNEXPECTED");              break;
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:    DEBUG_LOG("PM_EVT_PEER_DATA_UPDATE_SUCCEEDED");    break;
        case PM_EVT_PEER_DATA_UPDATE_FAILED:       DEBUG_LOG("PM_EVT_PEER_DATA_UPDATE_FAILED");       break;
        case PM_EVT_PEER_DELETE_SUCCEEDED:         DEBUG_LOG("PM_EVT_PEER_DELETE_SUCCEEDED");         break;
        case PM_EVT_PEER_DELETE_FAILED:            DEBUG_LOG("PM_EVT_PEER_DELETE_FAILED");            break;
        case PM_EVT_PEERS_DELETE_SUCCEEDED:        DEBUG_LOG("PM_EVT_PEERS_DELETE_SUCCEEDED");        break;
        case PM_EVT_PEERS_DELETE_FAILED:           DEBUG_LOG("PM_EVT_PEERS_DELETE_FAILED");           break;
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:        DEBUG_LOG("PM_EVT_LOCAL_DB_CACHE_APPLIED");        break;
        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:   DEBUG_LOG("PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED");   break;
        case PM_EVT_SERVICE_CHANGED_IND_SENT:      DEBUG_LOG("PM_EVT_SERVICE_CHANGED_IND_SENT");      break;
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED: DEBUG_LOG("PM_EVT_SERVICE_CHANGED_IND_CONFIRMED"); break;
        case PM_EVT_SLAVE_SECURITY_REQ:            DEBUG_LOG("PM_EVT_SLAVE_SECURITY_REQ");            break;
        default: break;
    }


    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            DEBUG_LOG("Connected to a previously bonded device.");
            /******app processing*****************/
            appAdvSetPrevConn(true);
            appAdvSetRealState(false);
            appConnectSetState(CONNECTION_CONNECT, p_evt->conn_handle);
            appAdvProcessing(ADV_EVT_START_CONNECT, p_evt->peer_id);
            /****** *******************************/
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            DEBUG_LOG("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);

            m_peer_id = p_evt->peer_id;

            /******app processing*****************/
            orderSetFirst(deviceOrder, p_evt->peer_id);
            orderWriteFlash(deviceOrder, GET_PAGE_ADDRESS(ORDER_FLASHE_PAGE));
            /*************************************/
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /******app processing*****************/
             appAdvStart();
            /*************************************/
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

